heatMap/heatMap_2D/1acu1rack/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;


vertices
(
    (31.40 8.60 0.00)
    (35.80 8.60 0.00)
    (35.80 13.60 0.00)
    (31.40 13.60 0.00)
    (31.40 8.60 3.80)
    (35.80 8.60 3.80)
    (35.80 13.60 3.80)
    (31.40 13.60 3.80)
);




blocks
(
    hex (0 1 2 3 4 5 6 7) (44 50 38) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    floor
    {
        type wall;
        faces
        (
            (0 3 2 1)
        );
    }
    ceiling
    {
        type wall;
        faces
        (
            (4 5 6 7)
        );
    }
    fixedWalls
    {
        type wall;
        faces
        (
            (0 1 5 4)
            (1 2 6 5)
            (0 4 7 3)
            (3 7 6 2)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
