heatMap/heatMap_2D/1acu1rack/system/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

porosity_floorvent564BBBA61D1156EE76433AB491E144D4
{
    type            explicitPorositySource;
    active          yes;
    selectionMode   cellZone;
    cellZone        floorvent564BBBA61D1156EE76433AB491E144D4;

    explicitPorositySourceCoeffs
    {
        type	    fixedCoeff; //DarcyForchheimer
        fixedCoeffCoeffs  //DarcyForchheimerCoeffs
        {
	    alpha    alpha [0 0 -1 0 0 0 0] (-1.315 -1.315 -1.315); //linear term U
            beta     beta [0 -1 0 0 0 0 0] (104.43 104.43 104.43); //squared term U
            /*d   d [0 -2 0 0 0 0 0] (6.3e4 6.3e4 6.3e4); 
            f   f [0 -1 0 0 0 0 0] (17.73 17.73 17.73); */

            coordinateSystem
            {
                type cartesian;
                origin (0 0 0);
		rho 1.225; // should be specified cuz we don't have rho in our simulation
                coordinateRotation
                {
                    type    axesRotation;
                    e1      (1 0 0);
                    e2      (0 1 0);
                }
            }
        }
    }
}
