heatMap/heatMap_2D/1acu1rack/system/probesDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    location        system;
    object          probesDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


// Fields to be probed. runTime modifiable!
fields
(
    T 
);

// Locations to be probed. runTime modifiable!
probeLocations
(





		
		
		
		
		
		
		
		
		
		
		
				
//inlet bottom
		 (33.15 12.200000000000001 0.97) 
		 (33.3 12.200000000000001 0.97) 
		 (33.45 12.200000000000001 0.97) 

		 (33.15 12.200000000000001 1.13) 
		 (33.3 12.200000000000001 1.13)
		 (33.45 12.200000000000001 1.13) 

//inlet mid 1
		 (33.15 12.200000000000001 1.46) 
		 (33.3 12.200000000000001 1.46) 
		 (33.45 12.200000000000001 1.46) 

		 (33.15 12.200000000000001 1.63) 
		 (33.3 12.200000000000001 1.63) 
		 (33.45 12.200000000000001 1.63)  

//inlet mid 2
		 (33.15 12.200000000000001 1.97)  
		 (33.3 12.200000000000001 1.97) 
		 (33.45 12.200000000000001 1.97) 

		 (33.15 12.200000000000001 2.13) 
		 (33.3 12.200000000000001 2.13) 
		 (33.45 12.200000000000001 2.13) 
 
//inlet top
		 (33.15 12.200000000000001 2.47) 
		 (33.3 12.200000000000001 2.47) 
		 (33.45 12.200000000000001 2.47) 

		 (33.15 12.200000000000001 2.63) 
		 (33.3 12.200000000000001 2.63) 
		 (33.45 12.200000000000001 2.63) 


//outlet bottom
		 (33.15 11.4 0.97) 
		 (33.3 11.4 0.97) 
		 (33.45 11.4 0.97) 

		 (33.15 11.4 1.13) 
		 (33.3 11.4 1.13) 
		 (33.45 11.4 1.13) 

//outlet mid 1
		 (33.15 11.4 1.46) 
		 (33.3 11.4 1.46) 
		 (33.45 11.4 1.46) 

		 (33.15 11.4 1.63) 
		 (33.3 11.4 1.63) 
		 (33.45 11.4 1.63)

//outlet mid 2
		 (33.15 11.4 1.97) 
		 (33.3 11.4 1.97) 
		 (33.45 11.4 1.97) 

		 (33.15 11.4 2.13) 
		 (33.3 11.4 2.13) 
		 (33.45 11.4 2.13) 
 
//outlet top
		 (33.15 11.4 2.47) 
		 (33.3 11.4 2.47) 
		 (33.45 11.4 2.47) 

		 (33.15 11.4 2.63) 
		 (33.3 11.4 2.63) 
		 (33.45 11.4 2.63) 	







);

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //