heatMap/heatMap_2D/1acu1rack/system/topoSetDict.sample
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      topoSetDict.sample;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
        {
      name    sample;
      type    cellSet;
      action  new;
      source  boxToCell;
      sourceInfo
      {
          box (31.40 8.60 1.71)(35.80 13.60 1.89); // sample region
      }
    }

 
);

// ************************************************************************* //
